import React, { useState } from "react"
import MyButton from "../UI/MyButton/MyButton"

const ResultTable = ({ getLinkMarkers }) => {
  const [results, setResults] = useState([
    {
      date: "16.10.2023",
      INN: "3246644879",
      result: "Высокий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "2368120869",
      result: "Средний риск банкротсва",
    },
    {
      date: "16.10.2023",
      INN: "1234567890",
      result: "Низкий риск банкротсва",
    },
  ])
  return (
    <>
      <div
        className="container mt-5 mb-5"
        style={{
          overflow: "auto",
        }}
      >
        <table className="text-center table  table-bordered table-responsive">
          <thead>
            <tr>
              <th scope="col">Дата</th>
              <th scope="col">Инн</th>
              <th scope="col">Результат</th>
            </tr>
          </thead>
          <tbody>
            {results.map((el) => {
              return (
                <tr>
                  <td>{el.date}</td>
                  <td className="text-center">{el.INN}</td>
                  <td>{el.result}</td>
                </tr>
              )
            })}
          </tbody>
        </table>
        <MyButton className="btn-outline-primary mt-2 mr-4" onClick={() => {}}>
          Подтвердить
        </MyButton>
        <MyButton className="btn-outline-danger mt-2" onClick={() => {}}>
          Отменить
        </MyButton>
      </div>
    </>
  )
}

export default ResultTable
